In [2]:
#Importing Libreries

import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#CLEAN UP
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\Naomi\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [3]:
import ast

df['job_skills'] = df['job_skills'].apply(
    lambda x: x if isinstance(x, list) else []
)

In [4]:
type(df['job_skills'].iloc[0])

list

In [5]:
# Calculate projected Salary Next Year
# Senior roles assume 5% 
# Other roles assume 3%
df_salary = df.dropna(subset=['salary_year_avg']).copy()

In [6]:
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary:salary * 1.03)
df_salary[['salary_year_avg','salary_year_inflated']]
df_salary.head(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,salary_year_inflated
28,Data Scientist,CRM Data Specialist,"San José Province, San José, Costa Rica",via Ai-Jobs.net,Full-time,False,Costa Rica,2023-08-01 13:37:57,False,False,Costa Rica,year,109500.0,NaN,Netskope,[],"{'analyst_tools': ['excel'], 'libraries': ['gd...",112785.00
77,Data Engineer,Data Engineer,"Arlington, VA",via LinkedIn,Full-time,False,Sudan,2023-06-26 14:22:54,False,False,Sudan,year,140000.0,NaN,Intelletec,[],"{'analyst_tools': ['tableau'], 'cloud': ['orac...",144200.00
92,Data Engineer,Remote - Data Engineer - Permanent - W2,Anywhere,via LinkedIn,Full-time,True,"Illinois, United States",2023-02-21 13:29:59,False,True,United States,year,120000.0,NaN,Apex Systems,[],"{'programming': ['sql', 'python']}",123600.00
100,Data Scientist,"Data Scientist, Risk Data Mining - USDS","Mountain View, CA",via LinkedIn,Full-time,False,"California, United States",2023-07-31 13:01:18,False,True,United States,year,228222.0,NaN,TikTok,[],"{'programming': ['sql', 'r', 'python'], 'webfr...",235068.66
109,Data Analyst,Senior Supply Chain Analytics Analyst,Anywhere,via Get.It,Full-time,True,"Illinois, United States",2023-10-12 13:02:19,False,True,United States,year,89000.0,NaN,Get It Recruit - Transportation,[],"{'analyst_tools': ['alteryx', 'tableau'], 'pro...",91670.00

In [7]:
def projected_salary(row):
    if "Senior" in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else:
        return 1.03 * row['salary_year_avg']

df_salary['salary_year_inflated'] = df_salary.apply(projected_salary,axis=1)

df_salary[['job_title_short','salary_year_avg','salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]

In [8]:
df_salary['salary_year_inflated'] = df_salary.apply(lambda row: 1.05 * row['salary_year_avg'] if 'Senior' in row['job_title_short'] else 1.03 * row['salary_year_avg'],axis=1)

df_salary[['job_title_short','salary_year_avg','salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]

In [13]:
# Convert the job_posted_date column to a string format 'YYYY-MM-DD' and create a new column job_posted_date_str.
# Hint:Use the apply() method with a lambda and strftime() to convert the datetime to string format.

df['job_posted_date_str'] = df['job_posted_date'].apply(
    lambda x: x.strftime('%Y-%m-%d')
)

df[['job_posted_date', 'job_posted_date_str']].head()

      job_posted_date job_posted_date_str
0 2023-06-16 13:44:15          2023-06-16
1 2023-01-14 13:18:07          2023-01-14
2 2023-10-10 13:14:55          2023-10-10
3 2023-07-04 13:01:41          2023-07-04
4 2023-08-07 14:29:36          2023-08-07

In [ ]:
# Calculate the number of days since each job was posted. Create a new column days_since_posted that contains this value. 
# Use the job_posted_date column.
# Note: You need to import the datetime library and use the datetime module to get the current date using .now().
# Hint:Use the apply() method with a lambda function to calculate the difference between the current date and the job posted date.

from datetime import datetime
current_date = datetime.now()
df['days_since_posted'] = df['job_posted_date'].apply(
    lambda date: (current_date - date).days)

df[['job_posted_date','days_since_posted']].head()

      job_posted_date  days_since_posted
0 2023-06-16 13:44:15                941
1 2023-01-14 13:18:07               1094
2 2023-10-10 13:14:55                825
3 2023-07-04 13:01:41                923
4 2023-08-07 14:29:36                889

In [24]:
df['days_since_posted'] = df['job_posted_date'].apply(
    lambda x: datetime.now() - x )

df[['job_posted_date','days_since_posted']].head()

      job_posted_date         days_since_posted
0 2023-06-16 13:44:15  941 days 02:45:02.589686
1 2023-01-14 13:18:07 1094 days 03:11:10.589686
2 2023-10-10 13:14:55  825 days 03:14:22.589686
3 2023-07-04 13:01:41  923 days 03:27:36.589686
4 2023-08-07 14:29:36  889 days 01:59:41.589686

In [27]:
# Create a copy of the DataFrame called df_filtered and drop the NaN values for salary_year_avg.
# Then, create a new column salary_category that categorizes the salary_year_avg into three categories: 
# 'Low' for salaries less than 60,000, 'Medium' for salaries between 60,000 and 100,000, and 
# 'High' for salaries greater than 100,000.
# Then show the df_filtered DataFrame and the salary_year_avg and salary_category columns.

df_filtered = df.dropna(subset=['salary_year_avg']).copy()
df_filtered['salary_category'] = df['salary_year_avg'].apply(lambda salary: 'Low' if salary < 60000 else 'Medium' if salary <= 100000 else 'High')
df_filtered[['salary_year_avg', 'salary_category']]

        salary_year_avg salary_category
28             109500.0            High
77             140000.0            High
92             120000.0            High
100            228222.0            High
109             89000.0          Medium
...                 ...             ...
785624         139216.0            High
785641         150000.0            High
785648         221875.0            High
785682         157500.0            High
785692         157500.0            High

[22003 rows x 2 columns]